/*
1 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (1,'Команда – это ',1,1);
INSERT INTO Questions VALUES (2,'Если задание не выполнено по вине любого члена команды, то',5,1);
INSERT INTO Questions VALUES (3,'Команда состоит из ',9,1);
INSERT INTO Questions VALUES (4,'Укажите, как влияет эффективное командное взаимодействие на каждого участника команды:
a)	работники удовлетворяют свои социальные потребности.
b)	работники активно участвуют в саморазвитии, наращивают профессиональный опыт.
c)	работники активно участвуют в определении уровня заработной платы для каждого участника группы.
',11,2);
INSERT INTO Questions VALUES (5,'Укажите преимущества командной работы
a)	Сотрудник, хорошо зарекомендовавший себя при работе в составе команды, получает дополнительную квалификацию, ценную как для него, так и для фирмы.
b)	Любой член команды, показавший недостаточную результативность, может «спрятаться» за активного участника командной работы.
c)	При принятии решения в команде учитываются мнения всех ее членов.
',13,2);
INSERT INTO Questions VALUES (6,'Верно ли, что командная работа  лучше индивидуального труда?',18,2);

/*
1 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (7,'Команде характерна философия:',21,3);
INSERT INTO Questions VALUES (8,'Деятельностью команды управляет',23,3);
INSERT INTO Questions VALUES (9,'Кто отвечает за конечный общекомандный результат?',25,3);

/*
1 лекция 3 тест Questions
 */

INSERT INTO Questions VALUES (10,' Эффективное командное взаимодействие - это
a)	коллеги становятся лояльнее друг к другу, даже если раньше у них были разногласия.
b)	общее дело вырабатывает у сотрудников такие качества, как раздражительность, вспыльчивость и неумение вести дискуссию.
c)	во время принятия важных решений будет учитываться мнение каждого участника.
',28,4);
INSERT INTO Questions VALUES (11,'Укажите преимущества командной работы
a)	В команде нарабатывается опыт сотрудничества и взаимной поддержки.
b)	Команда способна генерировать нестандартные решения, создавать «копилку решений».
c)	Процесс образования команды растянут по времени
',31,4);
INSERT INTO Questions VALUES (12,'Укажите преимущества командной работы',36,4);

/*
1 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (1,'это небольшое число людей со взаимодополняющими навыками, людей, которые собраны для совместного решения задач в целях повышения производительности и в соответствии с подходами, посредством которых они поддерживают взаимную ответственность.',1);
INSERT INTO Answers VALUES (2,'	это двое или более людей, работающих согласованно, но ставящих во главу угла достижение индивидуальных целей.',1);
INSERT INTO Answers VALUES (3,'	члены коллектива, связанные общими интересами и личным отношением, однако общей цели у них может и не быть – каждый работает над своей задачей.',1);

INSERT INTO Answers VALUES (4,'	он теряет в доверии, стимулировании, в общественном признании.',2);
INSERT INTO Answers VALUES (5,'	вся команда теряет в доверии, стимулировании, в общественном признании.',2);
INSERT INTO Answers VALUES (6,'	лидер команды теряет в доверии, стимулировании, в общественном признании.',2);

INSERT INTO Answers VALUES (7,'	сотрудников одного уровня и должности.',3);
INSERT INTO Answers VALUES (8,'	сотрудников одной должности, но разного уровня.',3);
INSERT INTO Answers VALUES (9,'	сотрудников, уровень и должности у которых могут быть разными.',3);

INSERT INTO Answers VALUES (10,'a,b,c',4);
INSERT INTO Answers VALUES (11,'a,b',4);
INSERT INTO Answers VALUES (12,'b',4);

INSERT INTO Answers VALUES (13,'a,c',5);
INSERT INTO Answers VALUES (14,'a',5);
INSERT INTO Answers VALUES (15,'a,b,c',5);

INSERT INTO Answers VALUES (16,'Верно.',6);
INSERT INTO Answers VALUES (17,'Не верно.',6);
INSERT INTO Answers VALUES (18,'Нельзя дать однозначный ответ, в каждой форме организации труда есть свои плюсы и минусы.',6);

/*
1 лекция 2 тест ответы
 */

INSERT INTO Answers VALUES (19,'«Я выиграю, за счет тебя», «Если я вижу что проиграю, я сделаю так, чтобы все проиграли».',7);
INSERT INTO Answers VALUES (20,'«Я выиграю, без тебя».',7);
INSERT INTO Answers VALUES (21,'«Я выиграю, когда мы все выиграем».',7);

INSERT INTO Answers VALUES (22,'Каждый член команды.',8);
INSERT INTO Answers VALUES (23,'Руководитель команды.',8);
INSERT INTO Answers VALUES (24,'Административное руководство организации.',8);

INSERT INTO Answers VALUES (25,'Каждый член команды.',9);
INSERT INTO Answers VALUES (26,'Руководитель команды.',9);
INSERT INTO Answers VALUES (27,'Административное руководство организации.',9);


/*
1 лекция 3 тест ответы
 */


INSERT INTO Answers VALUES (28,'a,c',10);
INSERT INTO Answers VALUES (29,'a,b,c',10);
INSERT INTO Answers VALUES (30,'b,c',10);

INSERT INTO Answers VALUES (31,'a,b',11);
INSERT INTO Answers VALUES (32,'a',11);
INSERT INTO Answers VALUES (33,'a,b,c',11);

INSERT INTO Answers VALUES (34,'жесткие групповые нормы. ',12);
INSERT INTO Answers VALUES (35,'замалчивание проблем и разногласий в группе.',12);
INSERT INTO Answers VALUES (36,'работники активно участвуют в развитии и помощи своим коллегам.',12);

/*
1 лекция тест
 */

INSERT INTO Test VALUES (1,'1;2;3;4;5;6');
INSERT INTO Test VALUES (2,'7;8;9');
INSERT INTO Test VALUES (3,'10;11;12');




/*
2 лекция 1 тест Questions
 */


INSERT INTO Questions VALUES (13,'Программные средства по своей природе существенно отличаются от непрограммных продуктов, услуг и результатов ',37,1);
INSERT INTO Questions VALUES (14,'Каждая программа ',40,1);
INSERT INTO Questions VALUES (15,'Опыт управления проектами по разработке программного обеспечения
a)	часто не может быть применён к другим проектам.
b)	не может быть применён к другим проектам.
c)	очень сильно отличается от управления проектами в инженерных отраслях, где заранее ясно, что и как делать.
',43,1);

INSERT INTO Questions VALUES (16,'При разработке программного обеспечения программный код ',46,2);
INSERT INTO Questions VALUES (17,'Цель  тестирования – это
a)	доказательство факта «безошибочности» программы.
b)	выявление как можно большего числа ошибок в программе.
',49,2);
INSERT INTO Questions VALUES (18,'Почему написание тестов и собственно разработка кода должна выполнятся различными людьми или даже различными командами на основе одной спецификации?
a)	Чтобы не загружать людей слишком большим объемом работы.
b)	Чтобы исключить допуск одинаковых ошибок в коде и в теста.
',53,2);

/*
2 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (19,'Почему инвестиции в разработку ПО связаны с высоким риском?
a)	Отсутствие четких правил, последовательности и алгоритмов создания программных
продуктов.
b)	Зачастую очень сложно бывает оценить объем выполненной и оставшейся работы по созданию программного продукта.
c)	Внести изменения в программное средство достаточно сложно.
',55,3);
INSERT INTO Questions VALUES (20,'Почему считается, что профессиональный программист должен «учиться, учиться и учиться»?
a)	Информационные технологии постоянно обновляются, а программисту необходимо знать и успешно применять их в своей работе.
b)	Чтобы быть разносторонне развитым человеком.
 ',59,3);
INSERT INTO Questions VALUES (21,'Менеджеру программных проектов достаточно иметь знания только в области управления проектами.',62,3);

/*
2 лекция 3 тест Questions
 */

INSERT INTO Questions VALUES (22,'Целью составления плана проекта является
a)	определение объёма и содержания работ, необходимых для успешного осуществления проекта.
b)	оценка затрат и составление графика работ.
c)	оперативное исправление выявленных ошибок.
',66,4);
INSERT INTO Questions VALUES (23,'Роль документирования в разработке ПО
a)	Документация обеспечивает «общее пространство» проекта. Любой участник в любой момент времени может получить необходимую информацию как по конкретной задаче, так и по общему направлению работы.
b)	Документирование позволяет четко разграничить зоны ответственности между участниками проекта.
',67,4);
INSERT INTO Questions VALUES (24,'Почему разработка программного продукта должна быть разделена на определённые этапы?
a)	 Для удобства разработчиков.
b)	для определения сроков выполнения той или иной части разработки.
',70,4);


/*
2 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (37,'неосязаемостью конечного продукта.',13);
INSERT INTO Answers VALUES (38,'неподатливостью, т.е. внести изменения в программное средство достаточно сложно.',13);
INSERT INTO Answers VALUES (39,'постоянством технологий.',13);

INSERT INTO Answers VALUES (40,'практически всегда уникальна.',14);
INSERT INTO Answers VALUES (41,'содержит только базовый набор характеристик, которым обладают все уже созданные программы.',14);
INSERT INTO Answers VALUES (42,'имеет только такие характеристики, которыми не обладает ни одна уже созданная.',14);

INSERT INTO Answers VALUES (43,'a,c,',15);
INSERT INTO Answers VALUES (44,'c,',15);
INSERT INTO Answers VALUES (45,'a,b',15);

INSERT INTO Answers VALUES (46,'соответствует базовым стандартам.',16);
INSERT INTO Answers VALUES (47,'не обязательно соответствует основным стандартам (на усмотрение программиста).',16);
INSERT INTO Answers VALUES (48,'не соответствует базовым стандартам. ',16);

INSERT INTO Answers VALUES (49,'a',17);
INSERT INTO Answers VALUES (50,'b',17);
INSERT INTO Answers VALUES (51,'a,b',17);

INSERT INTO Answers VALUES (52,'a',18);
INSERT INTO Answers VALUES (53,'b',18);
INSERT INTO Answers VALUES (54,'ни один из вариантов a),b) не является правильным.',18);

/*
2 лекция 2 тест ответы
 */

INSERT INTO Answers VALUES (55,'a,b',19);
INSERT INTO Answers VALUES (56,'b',19);
INSERT INTO Answers VALUES (57,'a,c',19);

INSERT INTO Answers VALUES (58,'a,b',20);
INSERT INTO Answers VALUES (59,'a',20);
INSERT INTO Answers VALUES (60,'b',20);

INSERT INTO Answers VALUES (61,'Верно.',21);
INSERT INTO Answers VALUES (62,'Не верно, менеджер программных проектов должен обладать и множеством знаний в области информационных технологий.',21);
INSERT INTO Answers VALUES (63,'Не верно, менеджер программных проектов должен обладать только знаниями в области информационных технологий.',21);

/*
2 лекция 3 тест ответы
 */


INSERT INTO Answers VALUES (64,'a,c',22);
INSERT INTO Answers VALUES (65,'b,c',22);
INSERT INTO Answers VALUES (66,'a,b',22);

INSERT INTO Answers VALUES (67,'a,b',23);
INSERT INTO Answers VALUES (68,'a',23);
INSERT INTO Answers VALUES (69,'нет правильного ответа.',23);

INSERT INTO Answers VALUES (70,'a,b',24);
INSERT INTO Answers VALUES (71,'a',24);
INSERT INTO Answers VALUES (72,'b',24);

/*
2 лекция тест
 */

INSERT INTO Test VALUES (4,'13;14;15;16;17;18');
INSERT INTO Test VALUES (5,'19;20;21');
INSERT INTO Test VALUES (6,'22;23;24');


/*
13 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (144,'Цель модульного тестирования – это
a)	выявление локализованных в модуле ошибок в реализации алгоритмов, а также в определении степени готовности системы к переходу на следующий уровень разработки и тестирования.
b)	изолировать отдельные части программы и показать, что по отдельности эти части работоспособны.
c)	показать, что основные подсистемы, из которых состоит проект, работают и нормально взаимодействуют друг с другом.
',426,1);
INSERT INTO Questions VALUES (145,'Цель комплексного тестирования – это
a)	изолировать отдельные части программы и показать, что по отдельности эти части работоспособны.
b)	проверка того, что каждый модуль программного продукта корректно согласуется с остальными модулями продукта.
c)	проверить, что система функционирует в точности, как и описано в спецификации (функциональных требованиях к системе).
',431,1);
INSERT INTO Questions VALUES (146,'
Тестирование программного обеспечения – это
a)	проверка соответствия между реальным и ожидаемым поведением программы, осуществляемая на конечном наборе тестов, выбранном определенным образом.
b)	процесс исследования, испытания программного продукта, имеющий две различные цели: продемонстрировать разработчикам и заказчикам, что программа соответствует требованиям и выявить ситуации, в которых поведение программы является правильным, желательным или соответствующим спецификации.
',434,1);

INSERT INTO Questions VALUES (147,'Что проводится практически всегда, выполняется методом проверки характеристик продукции с заданными требованиями, результатом является вывод о соответствии (или несоответствии) продукции?
a)	Валидация.
b)	Верификация.
',436,2);
INSERT INTO Questions VALUES (148,'Что проводится при необходимости, выполняется методом анализа заданных условий применения и оценки соответствия характеристик продукции этим требованиям, результатом является вывод о возможности применения продукции для конкретных условий?
a)	Валидация.
b)	Верификация.
',438,2);
INSERT INTO Questions VALUES (149,'Какой вид тестирования проверяет корректность поведения программы в реальных условиях?',442,2);

INSERT INTO Questions VALUES (150,'Автоматизированное тестирование, имитирующее работу определенного количества бизнес пользователей на каком-либо общем (разделяемом ими) ресурсе – это',445,3);
INSERT INTO Questions VALUES (151,'Тестирование удобства использования любых массовых продуктов проводить необязательно.',448,3);
INSERT INTO Questions VALUES (152,'Задачей тестирования производительности является –',450,3);



/*
13 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (153,'Выберите верное утверждение:',454,4);
INSERT INTO Questions VALUES (154,'Процесс в программировании, позволяющий проверить на корректность отдельные модули исходного кода программы – это',457,4);
INSERT INTO Questions VALUES (155,'Какой вид тестирования проверяется взаимодействие между компонентами системы после проведения компонентного тестирования?',459,4);

/*
13 лекция 3 тест Questions
 */

INSERT INTO Questions VALUES (156,'На какой вопрос отвечает тестирование подтверждения правильности и верификации?',462,5);
INSERT INTO Questions VALUES (157,'Какова цель тестирования в условиях нехватки ресурсов?

a)	Вывод о работоспособности основных функций системы.
b)	симулирование различных условий сбоя и последующее изучение и оценка реакции защитных систем. В процессе подобных проверок выясняется, была ли достигнута требуемая степень восстановления системы после возникновения сбоя.
c)	Проверить, как ведет себя система в реальных условиях.
',467,5);
INSERT INTO Questions VALUES (158,'Если проверка показала, что система будет вести себя корректно в идеальных условиях, то она будет вести себя корректно и в реальных условиях.',469,5);

/*
13 лекция 4 тест Questions
 */
INSERT INTO Questions VALUES (159,'Выберите цели тестирования производительности.
a)	Демонстрация того, что система удовлетворяет критериям производительности.
b)	Определить  производительность какой из двух или нескольких систем лучше.
c)	определить, какой элемент нагрузки или часть системы приводит к снижению производительности.
',472,6);

INSERT INTO Questions VALUES (160,'Какие факторы влияют на удобство использования пользовательского интерфейса?
a)	легкость обучения
b)	общая удовлетворенность
c)	часто ли человек допускает ошибки в работе
',476,6);
INSERT INTO Questions VALUES (161,'Как проводится тестирование удобства использования?',477,6);



/*
13 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (426,'a,b',144);
INSERT INTO Answers VALUES (427,'a',144);
INSERT INTO Answers VALUES (428,'b,c',144);

INSERT INTO Answers VALUES (429,'a',145);
INSERT INTO Answers VALUES (430,'a,c',145);
INSERT INTO Answers VALUES (431,'b',145);

INSERT INTO Answers VALUES (432,'a',146);
INSERT INTO Answers VALUES (433,'b',146);
INSERT INTO Answers VALUES (434,'a,b',146);

INSERT INTO Answers VALUES (435,'a',147);
INSERT INTO Answers VALUES (436,'b',147);
INSERT INTO Answers VALUES (437,'a,b',147);

INSERT INTO Answers VALUES (438,'a',148);
INSERT INTO Answers VALUES (439,'b',148);
INSERT INTO Answers VALUES (440,'a,b',148);

INSERT INTO Answers VALUES (441,'Тестирование удобства использования',149);
INSERT INTO Answers VALUES (442,'Тестирование в условиях нехватки ресурсов',149);
INSERT INTO Answers VALUES (443,'Комплексное тестирование',149);

INSERT INTO Answers VALUES (444,'Тестирование в условиях нехватки ресурсов',150);
INSERT INTO Answers VALUES (445,'Нагрузочное тестирование',150);
INSERT INTO Answers VALUES (446,'Тестирование удобства',150);

INSERT INTO Answers VALUES (447,'Верно',151);
INSERT INTO Answers VALUES (448,'Неверно',151);
INSERT INTO Answers VALUES (449,'Нельзя дать однозначного ответа',151);

INSERT INTO Answers VALUES (450,'определение масштабируемости приложения под нагрузкой',152);
INSERT INTO Answers VALUES (451,'изолировать отдельные части программы и показать, что по отдельности эти части работоспособны.',152);
INSERT INTO Answers VALUES (452,'проверка успешной инсталляции и настройки, а также обновления или удаления программного обеспечения.',152);

/*
13 лекция 2 тест ответы
 */

INSERT INTO Answers VALUES (453,'Модульное и комплексное тестирование – это одно и то же.',153);
INSERT INTO Answers VALUES (454,'Все используемые модули обязаны пройти собственное модульное тестирование перед тем как продолжать работу.',153);
INSERT INTO Answers VALUES (455,'Как только все модули прошли индивидуальное тестирование, значит модули правильно используют друг друга и безошибочно взаимодействуют между собой по всей системе.',153);

INSERT INTO Answers VALUES (456,'Комплексное тестирование',154);
INSERT INTO Answers VALUES (457,'Модульное тестирование',154);
INSERT INTO Answers VALUES (458,'Тестирование производительности',154);

INSERT INTO Answers VALUES (459,'Комплексное тестирование',155);
INSERT INTO Answers VALUES (460,'Модульное тестирование',155);
INSERT INTO Answers VALUES (461,'Тестирование производительности',155);

/*
13 лекция 3 тест ответы
 */

INSERT INTO Answers VALUES (462,'Пользователи сказали вам, что они хотели бы увидеть, но то ли это на самом деле?',156);
INSERT INTO Answers VALUES (463,'Будет ли ваше приложение работать на экране с разрешением 640 х 480 и 256 цветами?',156);
INSERT INTO Answers VALUES (464,'Является ли программа масштабируемой?',156);

INSERT INTO Answers VALUES (465,'a',157);
INSERT INTO Answers VALUES (466,'b',157);
INSERT INTO Answers VALUES (467,'b,c',157);

INSERT INTO Answers VALUES (468,'Верно',158);
INSERT INTO Answers VALUES (469,'Не верно',158);
INSERT INTO Answers VALUES (470,'Нельзя дать однозначный ответ',158);

/*
13 лекция 4 тест ответы
 */

INSERT INTO Answers VALUES (471,'a,c',159);
INSERT INTO Answers VALUES (472,'a,b,c',159);
INSERT INTO Answers VALUES (473,'a',159);

INSERT INTO Answers VALUES (474,'a,b',160);
INSERT INTO Answers VALUES (475,'b',160);
INSERT INTO Answers VALUES (476,'a,b,c',160);

INSERT INTO Answers VALUES (477,'Оно осуществляется с реальными пользователями в реальных условиях окружающей среды.',161);
INSERT INTO Answers VALUES (478,'Оно осуществляется разработчиками вручную.',161);
INSERT INTO Answers VALUES (479,'Оно осуществляется автоматизированно.',161);

/*
13 лекция тест
 */

INSERT INTO Test VALUES (25,'144;145;146;147;148;149;150;151;152');
INSERT INTO Test VALUES (26,'153;154;155');
INSERT INTO Test VALUES (27,'156;157;158');
INSERT INTO Test VALUES (28,'159;160;161');



/*
14 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (162,'Техническая документация – это',480,1);
INSERT INTO Questions VALUES (163,'Нужна ли техническая документация для программного обеспечения?',483,1);
INSERT INTO Questions VALUES (164,'Техническая документация может быть представлена в … виде.
a)	Электронном
b)	Печатном
',488,1);


/*
14 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (165,'Техническая документация не зависит от того, для чего или кого она создается.',489,2);
INSERT INTO Questions VALUES (166,' Техническая документация, которая  в отдельности или в совокупности с другими документами определяет правила эксплуатации изделия и (или) отражает сведения, удостоверяющие гарантированные изготовителем значения основных параметров и характеристик изделия, гарантии и  сведения по его эксплуатации в течении установленного срока службы – это',492,2);
INSERT INTO Questions VALUES (167,'Проектная документация, Данный вид документации разрабатывается',495,2);

/*
14 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (480,'набор документов, используемых при проектировании (конструировании), создании (изготовлении) и использовании (эксплуатации) каких-либо технических объектов: зданий, сооружений, промышленных товаров, программного и аппаратного обеспечения.',162);
INSERT INTO Answers VALUES (481,'это комплект документов, необходимых для соблюдения условий эксплуатации продукции. ',162);
INSERT INTO Answers VALUES (482,'комплекс графических и текстовых документов, определяющих технологический процесс  ремонта изделия.',162);

INSERT INTO Answers VALUES (483,'Да',163);
INSERT INTO Answers VALUES (484,'Нет',163);
INSERT INTO Answers VALUES (485,'Нельзя дать однозначный ответ',163);

INSERT INTO Answers VALUES (486,'a',164);
INSERT INTO Answers VALUES (487,'b',164);
INSERT INTO Answers VALUES (488,'a,b',164);

/*
14 лекция 2 тест ответы
 */

INSERT INTO Answers VALUES (489,'Верно',165);
INSERT INTO Answers VALUES (490,'Неверно',165);
INSERT INTO Answers VALUES (491,'Нельзя дать однозначный ответ',165);

INSERT INTO Answers VALUES (492,'Эксплуатационная документация',166);
INSERT INTO Answers VALUES (493,'документы, дающие информацию, необходимую для организации производства и ремонта изделия',166);
INSERT INTO Answers VALUES (494,'Ремонтная документация',166);

INSERT INTO Answers VALUES (495,'в процессе создания программного обеспечения.',167);
INSERT INTO Answers VALUES (496,'когда еще только планируется создание программного обеспечения.',167);
INSERT INTO Answers VALUES (497,'уже на готовое программное обеспечение.',167);

/*
14 лекция тест
 */

INSERT INTO Test VALUES (29,'162;163;164');
INSERT INTO Test VALUES (30,'165;166;167');


/*
15 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (168,'Что такое разделение труда?',498,1);
INSERT INTO Questions VALUES (169,'В разделении труда есть только преимущества.',503,1);
INSERT INTO Questions VALUES (170,'Укажите преимущества разделения труда в команде.
a)	Один человек не в состоянии создавать сложные программные комплексы в приемлемые сроки,  команде же это под силу.
b)	исключения работ по разбиению проекта на составляющие, по распределению их между исполнителями, по координации деятельности исполнителей и контролю за их работой.
c)	дает возможность при разработке больших программ использовать коллектив программистов, каждому из которых поручается составить программу для отдельной подпроблемы и которые могут работать параллельно и независимо друг от друга.
',505,1);

/*
15 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (171,'Почему возникла проблема разделения труда при разработке программ?
a)	Разработчику стало лень одному создавать программный продукт.
b)	из-за их сложности, объема и требований к качеству продукта и сопровождению.
c)	Один человек даже исключительных способностей оказался не в состоянии создавать сложные программные комплексы в приемлемые сроки.
',508,2);
INSERT INTO Questions VALUES (172,'Когда авторская разработка предпочтительнее командной?
a)	Когда цель разработчика - достижение профессионального успеха, известности и славы.
b)	При разработке небольших проектов
c)	Никогда
',512,2);
INSERT INTO Questions VALUES (173,'Если поручить работникам различные обязанности в проекте, то эффективность работы команды в целом будет всегда выше.',515,2);

/*
15 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (498,'каждый выполняет свою работу в проекте и отвечает за ее результаты.',168);
INSERT INTO Answers VALUES (499,'принцип создания программных продуктов, при котором весь жизненный цикл разработки поддерживается одним единственным человеком.',168);
INSERT INTO Answers VALUES (500,'Только один человек занимается разработкой продукта, но процесс разработки  делится на несколько этапов.',168);

INSERT INTO Answers VALUES (501,'Верно',169);
INSERT INTO Answers VALUES (502,'Неверно',169);
INSERT INTO Answers VALUES (503,'Нельзя дать однозначный ответ',169);

INSERT INTO Answers VALUES (504,'a',170);
INSERT INTO Answers VALUES (505,'a,c',170);
INSERT INTO Answers VALUES (506,'a,b,c',170);

/*
15 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (507,'c',171);
INSERT INTO Answers VALUES (508,'b,c',171);
INSERT INTO Answers VALUES (509,'a,b,c',171);

INSERT INTO Answers VALUES (510,'c',172);
INSERT INTO Answers VALUES (511,'b',172);
INSERT INTO Answers VALUES (512,'a,b',172);

INSERT INTO Answers VALUES (513,'Верно',173);
INSERT INTO Answers VALUES (514,'Неверно',173);
INSERT INTO Answers VALUES (515,'Нельзя дать однозначный ответ',173);

/*
15 лекция тест
 */

INSERT INTO Test VALUES (31,'168;169;170');
INSERT INTO Test VALUES (32,'171;172;173');




/*
16 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (174,'Распределенная команда – это
a)	способ организации работы, когда различные подразделения компании или рабочие группы территориально разделены.
b)	способ организации работы, когда различные подразделения компании или рабочие группы работают в разных странах.
',516,1);
INSERT INTO Questions VALUES (175,'Укажите плюсы работы распределенных команд.
a)	члены коллектива могут находиться в разных часовых поясах
b)	Разнообразие состава (люди разных национальностей, ментальностей, возрастов) предоставляет больше различных взглядов на проблему, различных точек зрения.
c)	удаленность членов коллектива друг от друга.
',519,1);
INSERT INTO Questions VALUES (176,'Что можно порекомендовать управляющему распределенным коллективом?
a)	Не стоит недооценивать значение небольших расстояний.
b)	  Важно, чтобы каждый член команды обладал лидерскими навыками
c)	Обеспечивайте личные встречи
',524,1);

/*
16 лекция 2 тест Questions
 */

INSERT INTO Questions VALUES (177,'Укажите минусы работы распределенных команд.
a)	удаленность членов коллектива друг от друга
b)	потенциально более низкий уровень доверия между сотрудниками (по меньшей мере, на начальном этапе работы)
c)	существует опасность размывания сплоченности команды из-за образования локальных подгрупп с собственными интересами.
',527,2);
INSERT INTO Questions VALUES (178,'Укажите какие команды являются распределенными.
a)	Члены команды находятся в разных странах
b)	Члены команды находятся в разных городах
c)	Члены команды находятся в одном городе, но в разных офисах
',530,2);
INSERT INTO Questions VALUES (179,'Какие условия нужно соблюдать при работе с удаленной командой?
a)	Необходимо сформулировать достаточно детализированные, количественные и качественные отчетные показатели, которые будут использоваться при формировании отчетности.
b)	Должен быть предусмотрен механизм обратной связи со всеми членами команды
c)	Удаленная команда не должна понимать, какие работы или продукты и в какие сроки должны быть реализованы.
',531,2);


/*
16 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (516,'a',174);
INSERT INTO Answers VALUES (517,'b',174);
INSERT INTO Answers VALUES (518,'a,b',174);

INSERT INTO Answers VALUES (519,'b',175);
INSERT INTO Answers VALUES (520,'b,c',175);
INSERT INTO Answers VALUES (521,'a,c',175);

INSERT INTO Answers VALUES (522,'a',176);
INSERT INTO Answers VALUES (523,'a,c',176);
INSERT INTO Answers VALUES (524,'a,b,c',176);


/*
16 лекция 2 тест ответы
 */

INSERT INTO Answers VALUES (525,'b,c',177);
INSERT INTO Answers VALUES (526,'c',177);
INSERT INTO Answers VALUES (527,'a,b,c',177);

INSERT INTO Answers VALUES (528,'a,b',178);
INSERT INTO Answers VALUES (529,'a',178);
INSERT INTO Answers VALUES (530,'a,b,c',178);

INSERT INTO Answers VALUES (531,'a,b',179);
INSERT INTO Answers VALUES (532,'b',179);
INSERT INTO Answers VALUES (533,'b,c',179);


/*
15 лекция тест
 */

INSERT INTO Test VALUES (33,'174;175l176');
INSERT INTO Test VALUES (34,'177;178;179');



/*
17 лекция 1 тест Questions
 */

INSERT INTO Questions VALUES (180,'Что общего у it- проектов и любой другой деятельности, направленной на получение прибыли?
a)	увеличение эффективности производства
b)	сокращение времени на разработку продукта
c)	уникальность готового продукта
',534,1);
INSERT INTO Questions VALUES (181,'Управление временем – это',537,1);
INSERT INTO Questions VALUES (182,'Управление временем приписывается только бизнесу или трудовой деятельности.',541,1);




/*
17 лекция 1 тест ответы
 */

INSERT INTO Answers VALUES (534,'a,b',180);
INSERT INTO Answers VALUES (535,'b',180);
INSERT INTO Answers VALUES (536,'a,b,c',180);

INSERT INTO Answers VALUES (537,'технология организации времени и повышения эффективности его использования.',181);
INSERT INTO Answers VALUES (538,'действие или процесс тренировки сознательного контроля над количеством времени, потраченного на конкретные виды деятельности, при котором специально уменьшаются эффективность и продуктивность.',181);
INSERT INTO Answers VALUES (539,'Стремление откладывать дела на потом.',181);

INSERT INTO Answers VALUES (540,'Верно',182);
INSERT INTO Answers VALUES (541,'Не верно',182);
INSERT INTO Answers VALUES (542,'Нельзя дать однозначный ответ.',182);


/*
17 лекция тест
 */

INSERT INTO Test VALUES (35,'180;181;182');